## **Summary Statistics**
From now on we will be using wallmart sales data.

In [1]:
import bz2
import pickle
import warnings 

warnings.filterwarnings("ignore")

In [2]:
filepath = "DataSets/walmart_sales.pkl.bz2"
zipfile = bz2.BZ2File(filepath)
data = zipfile.read()
newfilepath = filepath[:-4]
open(newfilepath, 'wb').write(data)

26029065

In [3]:
f = open("./DataSets/walmart_sales.pkl", "rb")
sales = pickle.load(f)
sales.head()

,store,type,department,date,weekly_sales,is_holiday,temperature_c,fuel_price_usd_per_l,unemployment
0,1,A,1,2010-02-05,24924.50,False,5.727778,0.679451,8.106
1,1,A,2,2010-02-05,50605.27,False,5.727778,0.679451,8.106
2,1,A,3,2010-02-05,13740.12,False,5.727778,0.679451,8.106
3,1,A,4,2010-02-05,39954.04,False,5.727778,0.679451,8.106
4,1,A,5,2010-02-05,32229.38,False,5.727778,0.679451,8.106

### **Mean and median**

Summary statistics are exactly what they sound like - they summarize many numbers in one statistic. For example, mean, median, minimum, maximum, and standard deviation are summary statistics. Calculating summary statistics allows you to get a better sense of your data, even if there's a lot of it.

- Explore your new DataFrame first by printing the first few rows of the `sales` DataFrame.
- Print information about the columns in `sales`.
- Print the mean of the `weekly_sales` column.
- Print the median of the `weekly_sales` column.

In [4]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 413119 entries, 0 to 413118
Data columns (total 9 columns):
 #   Column                Non-Null Count   Dtype
---  ------                --------------   -----
 0   store                 413119 non-null  int64
 1   type                  413119 non-null  object
 2   department            413119 non-null  int32
 3   date                  413119 non-null  datetime64[ns]
 4   weekly_sales          413119 non-null  float64
 5   is_holiday            413119 non-null  bool
 6   temperature_c         413119 non-null  float64
 7   fuel_price_usd_per_l  413119 non-null  float64
 8   unemployment          413119 non-null  float64
dtypes: bool(1), datetime64[ns](1), float64(4), int32(1), int64(1), object(1)
memory usage: 27.2+ MB

In [5]:
sales["weekly_sales"].mean()

16094.726811185497

In [6]:
sales["weekly_sales"].median()

7682.47

### **Summarizing dates**

Summary statistics can also be calculated on date columns which have values with the data type `datetime64`. Some summary statistics — like mean — don't make a ton of sense on dates, but others are super helpful, for example minimum and maximum, which allow you to see what time range your data covers.

- Print the maximum of the `date` column.
- Print the minimum of the `date` column.

In [7]:
print("The latest sale happend on:",sales["date"].max(),
      "and the earliest sale happend on:" ,sales["date"].min())

The latest sale happend on: 2012-10-26 00:00:00 and the earliest sale happend on: 2010-02-05 00:00:00

### **Efficient summaries**

While pandas and NumPy have tons of functions, sometimes you may need a different function to summarize your data.

- The `.agg()` method allows you to apply your own custom functions to a DataFrame, as well as apply functions to more than one column of a DataFrame at once, making your aggregations super efficient.

- In the custom function for this exercise, "IQR" is short for inter-quartile range, which is the 75th percentile minus the 25th percentile. It's an alternative to standard deviation that is helpful if your data contains outliers.

In [8]:
# A Custom IQR
def iqr(column):
    return column.quantile(0.75) - column.quantile(0.25)

- Use the custom `iqr` function defined for you along with `.agg()` to print the IQR of the `temperature_c` column of `sales`.

In [9]:
sales["temperature_c"].agg(iqr)

15.299999999999994

- Update the column selection to use the custom `iqr` function with `.agg()` to print the IQR of `temperature_c`, `fuel_price_usd_per_l`, and `unemployment`, in that order.

In [10]:
sales[["temperature_c","fuel_price_usd_per_l", "unemployment"]].agg(iqr)

temperature_c           15.300000
fuel_price_usd_per_l     0.211866
unemployment             1.672000
dtype: float64

- Update the aggregation functions called by `.agg()`: include `iqr` and `np.median` in that order.

In [11]:
import numpy as np
sales[["temperature_c", "fuel_price_usd_per_l", "unemployment"]].agg([iqr, np.median])

        temperature_c  fuel_price_usd_per_l  unemployment
iqr             15.30              0.211866         1.672
median          16.75              0.911922         7.852

### **Cumulative statistics**

Cumulative statistics can also be helpful in tracking summary statistics over time. In this exercise, you'll calculate the cumulative sum and cumulative max of a department's weekly sales, which will allow you to identify what the total sales were so far as well as what the highest weekly sales were so far.

A DataFrame called `sales_1_1` has been created for you, which contains the sales data for department 1 of store 1.

In [12]:
sales_1_1 = sales[(sales["store"] == 1) & (sales["department"] == 1)]

- Sort the rows of `sales_1_1` by the `date` column in ascending order.

In [13]:
sales_1_1 = sales_1_1.sort_values("date")

- Get the cumulative sum of `weekly_sales` and add it as a new column of `sales_1_1` called `cum_weekly_sales`.

In [14]:
sales_1_1["cum_weekly_sales"] = sales_1_1["weekly_sales"].cumsum()

- Get the cumulative maximum of `weekly_sales`, and add it as a column called `cum_max_sales`.

In [15]:
sales_1_1["cum_max_sales"] = sales_1_1["weekly_sales"].cummax()

- Print the `date`, `weekly_sales`, `cum_weekly_sales`, and `cum_max_sales` columns.

In [16]:
sales_1_1[["date", "weekly_sales", "cum_weekly_sales", "cum_max_sales"]].head()

          date  weekly_sales  cum_weekly_sales  cum_max_sales
0   2010-02-05      24924.50          24924.50       24924.50
73  2010-02-12      46039.49          70963.99       46039.49
145 2010-02-19      41595.55         112559.54       46039.49
218 2010-02-26      19403.54         131963.08       46039.49
290 2010-03-05      21827.90         153790.98       46039.49

## **Counting**

### **Dropping duplicates**

Removing duplicates is an essential skill to get accurate counts, because often you don't want to count the same thing multiple times. In this exercise, you'll create some new DataFrames using unique values from sales.

- Remove rows of sales with duplicate pairs of `store` and `type` and save as `store_types` and print the head.

In [17]:
store_types = sales.drop_duplicates(subset=["store","type"])
store_types.head()

,store,type,department,date,weekly_sales,is_holiday,temperature_c,fuel_price_usd_per_l,unemployment
0,1,A,1,2010-02-05,24924.50,False,5.727778,0.679451,8.106
10244,2,A,1,2010-02-05,35034.06,False,4.550000,0.679451,8.324
20482,3,B,1,2010-02-05,6453.58,False,7.616667,0.679451,7.368
29518,4,A,1,2010-02-05,38724.42,False,6.533333,0.686319,8.623
39790,5,B,1,2010-02-05,9323.89,False,4.277778,0.679451,6.566

- Remove rows of `sales` with duplicate pairs of `store` and `department` and save as `store_depts` and print the head.

In [18]:
store_depts = sales.drop_duplicates(subset=["store","department"])
store_depts.head()

,store,type,department,date,weekly_sales,is_holiday,temperature_c,fuel_price_usd_per_l,unemployment
0,1,A,1,2010-02-05,24924.50,False,5.727778,0.679451,8.106
1,1,A,2,2010-02-05,50605.27,False,5.727778,0.679451,8.106
2,1,A,3,2010-02-05,13740.12,False,5.727778,0.679451,8.106
3,1,A,4,2010-02-05,39954.04,False,5.727778,0.679451,8.106
4,1,A,5,2010-02-05,32229.38,False,5.727778,0.679451,8.106

- Subset the rows that are holiday weeks, and drop the duplicate `date`s, saving as `holiday_dates`.

In [19]:
holiday_dates = sales[sales["is_holiday"]].drop_duplicates(subset="date")
holiday_dates.head()

,store,type,department,date,weekly_sales,is_holiday,temperature_c,fuel_price_usd_per_l,unemployment
73,1,A,1,2010-02-12,46039.49,True,3.616667,0.673111,8.106
2218,1,A,1,2010-09-10,18194.74,True,25.938889,0.677602,7.787
3014,1,A,1,2010-11-26,18820.29,True,18.066667,0.722511,7.838
3372,1,A,1,2010-12-31,19124.58,True,9.127778,0.777459,7.838
3800,1,A,1,2011-02-11,37887.17,True,2.438889,0.798328,7.742

### **Counting categorical variables**

Counting is a great way to get an overview of your data and to spot curiosities that you might not notice otherwise. In this exercise, you'll count the number of each type of store and the number of each department number using the DataFrames you created in the previous exercise:
```python
# Drop duplicate store/type combinations
store_types = sales.drop_duplicates(subset=["store", "type"])

# Drop duplicate store/department combinations
store_depts = sales.drop_duplicates(subset=["store", "department"])
```

- Count the number of stores of each store `type` in `store_types`.

In [20]:
store_counts = store_types["type"].value_counts()
store_counts

A    22
B    17
C     6
Name: type, dtype: int64

- Count the proportion of stores of each store `type` in `store_types`.

In [21]:
store_props = store_types["type"].value_counts(normalize=True)
store_props

A    0.488889
B    0.377778
C    0.133333
Name: type, dtype: float64

- Count the number of different `department`s in `store_depts`, sorting the counts in descending order.

In [22]:
dept_counts_sorted = store_depts["department"].value_counts(sort=True)
print(list(dept_counts_sorted))

[45, 45, 45, 45, 45, 45, 45, 45, 45, 44, 44, 44, 44, 44, 44, 44, 44, 44, 44, 44, 44, 44, 44, 44, 44, 44, 44, 44, 44, 44, 44, 44, 44, 44, 44, 44, 44, 44, 44, 44, 44, 44, 44, 44, 44, 44, 44, 44, 44, 44, 44, 44, 44, 44, 43, 43, 42, 42, 42, 42, 42, 41, 39, 38, 38, 37, 37, 36, 36, 36, 36, 36, 36, 36, 33, 25, 20, 14, 5, 5, 1]

- Count the proportion of different `department`s in `store_depts`, sorting the proportions in descending order.

In [23]:
dept_props_sorted = store_depts["department"].value_counts(sort=True, normalize=True)
dept_props_sorted

1     0.013778
9     0.013778
4     0.013778
6     0.013778
8     0.013778
        ...
37    0.006124
50    0.004287
43    0.001531
39    0.001531
65    0.000306
Name: department, Length: 81, dtype: float64

## **Grouped Summary Statistics**

### **What percent of sales occurred at each store type?**

While `.groupby()` is useful, you can calculate grouped summary statistics without it.

Walmart distinguishes three types of stores: "supercenters", "discount stores", and "neighborhood markets", encoded in this dataset as type "A", "B", and "C". In this exercise, you'll calculate the total sales made at each store type, without using `.groupby()`. You can then use these numbers to see what proportion of Walmart's total sales were made at each.

- Calculate the total weekly sales over the whole dataset.

In [24]:
sales_all = sales["weekly_sales"].sum()
print("Total Weekly Sales" ,sales_all)

Total Weekly Sales 6649037445.509999

- Subset for type "A" stores, and calculate their total weekly sales.

In [25]:
sales_A = sales[sales["type"] == "A"]["weekly_sales"].sum()
print("Total weekly sales of type A store",sales_A)

Total weekly sales of type A store 4331014722.749999

- Do the same for type "B" and type "C" stores.

In [26]:
sales_B = sales[sales["type"] == "B"]["weekly_sales"].sum()
sales_C = sales[sales["type"] == "C"]["weekly_sales"].sum()
print("Total weekly sales of type B and type C store respectively:",sales_B, ",", sales_C)

Total weekly sales of type B and type C store respectively: 1912519195.2199998 , 405503527.53999996

- Combine the A/B/C results into a list, and divide by overall sales to get the proportion of sales by type.

In [27]:
sales_propn_by_type = [sales_A, sales_B, sales_C] / sales_all
sales_propn_by_type

array([0.65137469, 0.28763851, 0.0609868 ])

### **Calculations with `.groupby()`**

The `.groupby()` method makes life much easier. In this exercise, you'll perform the same calculations as last time, except you'll use the `.groupby()` method. You'll also perform calculations on data grouped by two variables to see if sales differs by store type depending on if it's a holiday week or not.

- Group `sales` by "`type`", take the sum of "`weekly_sales`", and store as `sales_by_type`.

In [28]:
sales_by_type = sales.groupby("type")["weekly_sales"].sum()
sales_by_type

type
A    4.331015e+09
B    1.912519e+09
C    4.055035e+08
Name: weekly_sales, dtype: float64

- Calculate the proportion of sales at each store type by dividing by the sum of `sales_by_type`. Assign to `sales_propn_by_type`.

In [29]:
sales_propn_by_type = sales_by_type/sum(sales_by_type)
sales_propn_by_type

type
A    0.651375
B    0.287639
C    0.060987
Name: weekly_sales, dtype: float64

### **Multiple grouped summaries**

Earlier in this chapter you saw that the `.agg()` method is useful to compute multiple statistics on multiple variables. It also works with grouped data. NumPy, which is imported as np, has many different summary statistics functions, including: `np.min`, `np.max`, `np.mean`, and `np.median`.

*Note that the column name fuel_price_usd_per_l has a lowercase "L" at the end, not the number 1.*

- Get the min, max, mean, and median of `weekly_sales` for each store type using `.groupby()` and `.agg()`. Store this as `sales_stats`. Make sure to use `numpy` functions!

In [30]:
sales_stats = sales.groupby("type")["weekly_sales"].agg([np.min,np.max,np.mean, np.median])
sales_stats

         amin       amax          mean    median
type
A    -4988.94  474330.10  20099.568043  10105.17
B    -3924.00  693099.36  12335.331875   6269.02
C     -379.00  112152.35   9519.532538   1149.67

- Get the min, max, mean, and median of `unemployment` and `fuel_price_usd_per_l` for each store type. Store this as `unemp_fuel_stats`.

In [31]:
unemp_fuel_stats = sales.groupby(["type"])["unemployment", 
                                           "fuel_price_usd_per_l"].agg([np.min,
                                                                        np.max,np.mean, np.median])
unemp_fuel_stats

     unemployment                          fuel_price_usd_per_l            \
             amin    amax      mean median                 amin      amax
type
A           3.879  14.313  7.791595  7.818             0.653034  1.180321
B           4.125  14.313  7.889666  7.806             0.664129  1.180321
C           5.217  14.313  8.934350  8.300             0.664129  1.180321


          mean    median
type
A     0.883391  0.902676
B     0.892997  0.922225
C     0.888848  0.902676

## **Pivot Tables**

### **Pivoting on one variable**

Pivot tables are the standard way of aggregating data in spreadsheets. In pandas, pivot tables are essentially just another way of performing grouped calculations. That is, the `.pivot_table()` method is just an alternative to `.groupby()`.

In this exercise, you'll perform calculations using `.pivot_table()` to replicate the calculations you performed in the last lesson using `.groupby()`.

- Get the mean `weekly_sales` by type using `.pivot_table()` and store as `mean_sales_by_type`.

In [32]:
mean_sales_by_type = sales.pivot_table(values="weekly_sales", index="type")
mean_sales_by_type

      weekly_sales
type
A     20099.568043
B     12335.331875
C      9519.532538

- Get the mean and median (using NumPy functions) of `weekly_sales` by type using `.pivot_table()` and store as `mean_med_sales_by_type`.

In [33]:
mean_med_sales_by_type = sales.pivot_table(values="weekly_sales", index="type", aggfunc=[np.mean, np.median])
mean_med_sales_by_type

              mean       median
      weekly_sales weekly_sales
type
A     20099.568043     10105.17
B     12335.331875      6269.02
C      9519.532538      1149.67

- Get the mean of `weekly_sales` by `type` and `is_holiday` using `.pivot_table()` and store as `mean_sales_by_type_holiday`.

In [34]:
mean_sales_by_type_holiday = sales.pivot_table(values="weekly_sales", index="type", columns="is_holiday")
mean_sales_by_type_holiday

is_holiday         False         True
type
A           20008.746759  21297.517824
B           12248.741339  13478.844240
C            9518.528116   9532.963131

### **Fill in missing values and sum values with pivot tables**

The `.pivot_table()` method has several useful arguments, including `fill_value` and `margins`.

`fill_value` replaces missing values with a real value (known as imputation). What to replace missing values with is a topic big enough to have its own course (Dealing with Missing Data in Python), but the simplest thing to do is to substitute a dummy value.
`margins` is a shortcut for when you pivoted by two variables, but also wanted to pivot by each of those variables separately: it gives the row and column totals of the pivot table contents.

In this exercise, you'll practice using these arguments to up your pivot table skills, which will help you crunch numbers more efficiently!

Print the mean `weekly_sales` by `department` and `type`, filling in any missing values with `0`.

In [35]:
sales.pivot_table(values="weekly_sales", index="type", columns="department", fill_value=0).T.head()

type                   A             B             C
department
1           22956.887886  17990.876158   8951.733462
2           51994.674873  43051.996919  14424.851713
3           13881.033137  12965.414311    820.276818
4           32973.814075  21259.895804  13669.370396
5           26803.448045  21184.602916    767.600774

Print the mean `weekly_sales` by `department` and `type`, filling in any missing values with `0` and summing all rows and columns.

In [36]:
sales.pivot_table(values="weekly_sales", index="department", columns="type", fill_value=0, margins=True).head()

type                   A             B             C           All
department
1           22956.887886  17990.876158   8951.733462  19213.485088
2           51994.674873  43051.996919  14424.851713  43607.020113
3           13881.033137  12965.414311    820.276818  11793.698516
4           32973.814075  21259.895804  13669.370396  25974.630238
5           26803.448045  21184.602916    767.600774  21365.583515